Revit 2026 API

# FormUtilsDissolveForms(Document, ICollectionElementId, ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> DissolveForms(
	Document ADoc,
	ICollection<ElementId> elements,
	out ICollection<ElementId> ProfileOriginPointSet
)
```
```vb
Public Shared Function DissolveForms (
	ADoc As Document,
	elements As ICollection(Of ElementId),
	<OutAttribute> ByRef ProfileOriginPointSet As ICollection(Of ElementId)
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ DissolveForms(
	Document^ ADoc,
	ICollection<ElementId^>^ elements,
	[OutAttribute] ICollection<ElementId^>^% ProfileOriginPointSet
)
```
```fsharp
static member DissolveForms :
        ADoc : Document *
        elements : ICollection<ElementId> *
        ProfileOriginPointSet : ICollection<ElementId> byref -> ICollection<ElementId>
```

#### Parameters

ADoc Document

elements ICollectionElementId

ProfileOriginPointSet ICollectionElementId

#### Return Value

ICollectionElementId

#### Reference

FormUtils Class

DissolveForms Overload

Autodesk.Revit.DB Namespace